import tkinter as tk
import random
from binascii import a2b_qp

mainwindow = tk.Tk()
mainwindow.geometry("1200x800")
mainwindow.config(bg="dark gray")

questions = [
    "Какая планета самая большая в нашей солнечной системе?",
    "Что такое 2 + 2?",
    "Какая страна является самой большой по территории?",
    "Кто написал роман 'Война и мир'?",
    "Что такое 'Python'?",
    "Какая часть тела человека отвечает за зрение?",
    "Кто является первым президентом США?",
    "Сколько континентов на Земле?",
    "Какая самая длинная река в мире?",
    "Как называется столица Франции?",
    "Какое химическое соединение является основным компонентом воды?",
    "Какая валюта используется в Японии?",
    "Какой элемент таблицы Менделеева имеет символ 'O'?",
    "Кто открыл закон всемирного тяготения?",
    "Какой город является столицей России?",
    "Какая река протекает через Египет?",
    "Сколько океанов на Земле?",
    "Какое государство является самым маленьким по площади?",
    "Какой элемент является самым легким в таблице Менделеева?",
    "Какая планета в нашей солнечной системе ближе всего к Солнцу?",
    "Сколько материков на Земле?",
    "Какая страна известна как 'Страна восходящего солнца'?",
    "Какой космический объект является карликовой планетой?",
    "Кто изобрел телефон?",
    "Какой элемент в таблице Менделеева обозначается как 'Na'?"
]

answers = [
    ["Юпитер", "Сатурн", "Земля", "Марс"],
    ["4", "5", "3", "6"],
    ["Россия", "Канада", "США", "Китай"],
    ["Лев Толстой", "Федор Достоевский", "Александр Пушкин", "Николай Гоголь"],
    ["Язык программирования", "Мифическое существо", "Тип змеи", "Робот"],
    ["Глаза", "Уши", "Нос", "Рот"],
    ["Джордж Вашингтон", "Авраам Линкольн", "Томас Джефферсон", "Рональд Рейган"],
    ["7", "6", "5", "8"],
    ["Нил", "Амазонка", "Миссисипи", "Янцзы"],
    ["Париж", "Берлин", "Лондон", "Мадрид"],
    ["H2O", "CO2", "O2", "N2"],
    ["Йена", "Доллар", "Евро", "Фунт стерлингов"],
    ["Кислород", "Азот", "Углерод", "Водород"],
    ["Исаак Ньютон", "Галилео Галилей", "Альберт Эйнштейн", "Никола Тесла"],
    ["Москва", "Санкт-Петербург", "Казань", "Екатеринбург"],
    ["Нил", "Амазонка", "Миссисипи", "Дунай"],
    ["5", "4", "3", "6"],
    ["Ватикан", "Монако", "Сингапур", "Лихтенштейн"],
    ["Водород", "Гелий", "Литий", "Бериллий"],
    ["Меркурий", "Венера", "Земля", "Марс"],
    ["6", "7", "5", "8"],
    ["Япония", "Китай", "Индия", "Южная Корея"],
    ["Плутон", "Марс", "Юпитер", "Венера"],
    ["Александр Белл", "Никола Тесла", "Томас Эдисон", "Грэм Белл"],
    ["Натрий", "Никель", "Азот", "Калий"]
]



rnumber = random.randint(0,len(questions)-1)
rquestion = questions[rnumber]
ranswer = answers[rnumber]
print(rquestion,ranswer)

question = tk.Label(text=f"{rquestion}",font=("Arial", 25),bg="dark gray")
question.pack(pady=30)
a1 = tk.Button(text=ranswer[0],font=("Impact",30),bg="dark gray")
a1.place(x=275,y=325)








mainwindow.mainloop()